
-- insert into Roles(role_name) values('Клиент'), ('Менеджер'), ('Администратор'), ('Тренер'); 

-- insert into Users(u_role) values (1),(1),(1),(1),
-- (1),(1), (2),(3), (4), (4);

--insert into Client values
-- (1,'Иван', 'Иванов', 'Иванович', 'г.Москва, ул. Московская, д.1', '+77777777777', '2001-12-23'),
-- (2,'Пётр', 'Петров', 'Петрович', 'г.Москва, ул. Московская, д.2', '+88888888888', '2002-02-03'),
-- (3,'Сидр', 'Сидоров', 'Сидорович', 'г.Москва, ул. Московская, д.3', '+23583769812', '2003-06-11'),
-- (4,'Алексей', 'Алексеев', 'Алексеевич', 'г.Москва, ул. Московская, д.4', '+34875289365', '2001-12-23'),
--(5,'Даниил', 'Данилов', 'Данилович', 'г.Москва, ул. Московская, д.5', '+98692523433', '2006-03-16'),
--(6,'Назар', 'Назаров', 'Назарович', 'г.Москва, ул. Московская, д.6', '+93435458374', '2002-02-02');


-- insert into employees values 
-- (7,2,'Иван', 'Иванов', 'Витальевич', 'г.Москва, ул. Московская, д.7', '+74444447777', '2000-12-13', 60000),
-- (8,3,'Егор', 'Егоров', 'Егорович', 'г.Москва, ул. Московская, д.8', '+11111188888', '1999-07-30', 90000),
-- (9,4,'Максим', 'Максимов', 'Максимович', 'г.Москва, ул. Московская, д.9', '+88888869812', '2001-06-11', 45000),
-- (10,4,'Лука', 'Лукин', 'Лукинович', 'г.Москва, ул. Московская, д.10', '+34875299995', '1990-01-10', 45000);

-- insert into Trainings(t_name) values ('Йога'), ('Бодибилдинг'), ('Бокс'), ('Синхронное Плавание');

-- insert into Services(s_name) values ('Персональная тренировка'), ('Консультация'), ('Групповая тренировка'), ('Мастер класс');

-- insert into season_ticket(training_code, service_code, price, visiting_amount, days_active) values
-- (1,3,10000,10,80), (2,1,70000,50,365), (3,3,45000,20,120), (4,3,50000,25,150);

-- insert into passwords(login, p_password, user_id) values
-- ('Иван1','qwerty1',1), ('Пётр2','qwerty2',2), ('Сидр3','qwerty3',3), ('Алексей4','qwerty4',4), 
-- ('Даниил5','qwerty6',5), ('Назар6','qwerty7',6), ('Иван111','qwerty8',7), ('Егор8','qwertyadmin',8), 
-- ('Максим9','qwerty9',9), ('Лука10','qwerty10',10);

-- insert into season_tickets_active(season_ticket_code, client_code, date_start, date_end, last_visitings) values 
-- (9,1,'2024-01-01','2024-03-21', 10), (10,3,'2024-02-10','2024-06-10', 20), (11,4,'2023-08-01','2023-12-29', 17); 


-- insert into schedule(date_conduction, time_start, time_end, emp_code, service_code, training_code) values 
-- ('2023-12-23', '14:30:00', '15:30:00', 9,3,3),
-- ('2023-12-24', '15:40:00', '16:40:00', 10,3,3),
-- ('2023-12-24', '14:35:00', '15:35:00', 10,4,2),
-- ('2023-12-24', '13:30:00', '14:30:00', 9,4,3),
-- ('2023-12-23', '12:00:00', '13:00:00', 9,1,1);

-- insert into visit_control(schedule_code, client_card_code) values
-- (1,8),(2,8);




